MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512ZVMC10/mcu.h
#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR1 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR1 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR1 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR2 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR2 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR2 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR3 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR3 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR3 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR4 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR4 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR4 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold



#endif // __MK10DN512ZVMC10_H__

